/*
---------------------Задача 5-------------------------
Каталог товаров книжного магазина сохранен в виде двумерного
списка List<ArrayList<String>> так, что на 0й позиции каждого
внутреннего списка содержится название жанра, а на остальных
позициях - названия книг. Напишите метод для заполнения данной
структуры.


Проза    | Поэзия    | Документал    |           |           |
--------------------------------------------------------------
Война и  | Бородино  |               |           |           |
мир      |           |               |           |           |
--------------------------------------------------------------
12       |           |               |           |           |
стульев  |           |               |           |           |
--------------------------------------------------------------
         |           |               |           |           |
--------------------------------------------------------------
         |           |               |           |           |
--------------------------------------------------------------
*/

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class Task5 {
    public static void main(String[] args) {
        List<ArrayList<String>> catalog = new ArrayList<>();// - 1. Метод создания списка, состоящий из названия планет
        ArrayList<String> genre1 = new ArrayList<>(Arrays.asList("Жанр 1", "Книга 1", "Книга 2", "Книга 3"));
        ArrayList<String> genre2 = new ArrayList<>(Arrays.asList("Жанр 2", "Книга 1", "Книга 2", "Книга 3"));
        ArrayList<String> genre3 = new ArrayList<>(Arrays.asList("Жанр 3", "Книга 1", "Книга 2", "Книга 3"));
        catalog.addAll(Arrays.asList(genre1, genre2, genre3));

        // Вывод двумерного списка:
        for (ArrayList<String> genre : catalog) {
            System.out.println(genre); // [Жанр 1, Книга 1, Книга 2, Книга 3]
                                       // [Жанр 2, Книга 1, Книга 2, Книга 3]
                                       // [Жанр 3, Книга 1, Книга 2, Книга 3]
        }
    }
}